#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mdata.aws_iam_role.frameFlowIamRole: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_status.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_load.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_load.data.aws_caller_identity.current: Read complete after 0s [id=187455689029][0m
[0m[1mmodule.sns_topic_video_status.data.aws_caller_identity.current: Read complete after 0s [id=187455689029][0m
[0m[1mdata.aws_iam_role.frameFlowIamRole: Read complete after 1s [id=LabRole][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_eks_access_entry.access[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "access" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = "frameFlow-eks-cluster"
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = [
          [32m+[0m[0m "fiap-frameFlow",
          [32m+[0m[0m "pos-tech",
        ]
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::187455689029:role/voclabs"
      [32m+[0m[0m tags_all          = (known after apply)
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # aws_eks_access_policy_association.example[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "example" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = "frameFlow-eks-cluster"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::187455689029:role/voclabs"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m type = "cluster"
        }
    }

[1m  # aws_eks_cluster.frameFlowEksCluster[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "frameFlowEksCluster" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "frameFlow-eks-cluster"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = "arn:aws:iam::187455689029:role/LabRole"
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Name" = "FrameFlowEksCluster"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Name" = "FrameFlowEksCluster"
        }
      [32m+[0m[0m version                       = (known after apply)

      [32m+[0m[0m access_config {
          [32m+[0m[0m authentication_mode = "API_AND_CONFIG_MAP"
        }

      [32m+[0m[0m kubernetes_network_config (known after apply)

      [32m+[0m[0m upgrade_policy (known after apply)

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = false
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = (known after apply)
          [32m+[0m[0m security_group_ids        = (known after apply)
          [32m+[0m[0m subnet_ids                = (known after apply)
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.fiap51BurguerNode[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "fiap51BurguerNode" {
      [32m+[0m[0m ami_type               = (known after apply)
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = (known after apply)
      [32m+[0m[0m cluster_name           = "frameFlow-eks-cluster"
      [32m+[0m[0m disk_size              = 50
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.medium",
        ]
      [32m+[0m[0m node_group_name        = "frameFlow-node"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = "arn:aws:iam::187455689029:role/LabRole"
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = (known after apply)
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m node_repair_config (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 2
          [32m+[0m[0m max_size     = 4
          [32m+[0m[0m min_size     = 1
        }

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable = 1
        }
    }

[1m  # aws_internet_gateway.myIgw[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "myIgw" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags_all = (known after apply)
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # aws_route_table.RTApp[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "RTApp" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m gateway_id                 = (known after apply)
                [90m# (11 unchanged attributes hidden)[0m[0m
            },
        ]
      [32m+[0m[0m tags_all         = (known after apply)
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # aws_route_table_association.RTAssociationA[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "RTAssociationA" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.publicRTAssociationB[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "publicRTAssociationB" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_s3_bucket.frames[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "frames" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "frames-video-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "PRD"
          [32m+[0m[0m "Name"        = "FrameFlow bucket"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "PRD"
          [32m+[0m[0m "Name"        = "FrameFlow bucket"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)

      [32m+[0m[0m cors_rule (known after apply)

      [32m+[0m[0m grant (known after apply)

      [32m+[0m[0m lifecycle_rule (known after apply)

      [32m+[0m[0m logging (known after apply)

      [32m+[0m[0m object_lock_configuration (known after apply)

      [32m+[0m[0m replication_configuration (known after apply)

      [32m+[0m[0m server_side_encryption_configuration (known after apply)

      [32m+[0m[0m versioning (known after apply)

      [32m+[0m[0m website (known after apply)
    }

[1m  # aws_s3_bucket.original[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "original" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "original-video-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "PRD"
          [32m+[0m[0m "Name"        = "FrameFlow bucket"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "PRD"
          [32m+[0m[0m "Name"        = "FrameFlow bucket"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)

      [32m+[0m[0m cors_rule (known after apply)

      [32m+[0m[0m grant (known after apply)

      [32m+[0m[0m lifecycle_rule (known after apply)

      [32m+[0m[0m logging (known after apply)

      [32m+[0m[0m object_lock_configuration (known after apply)

      [32m+[0m[0m replication_configuration (known after apply)

      [32m+[0m[0m server_side_encryption_configuration (known after apply)

      [32m+[0m[0m versioning (known after apply)

      [32m+[0m[0m website (known after apply)
    }

[1m  # aws_security_group.clusterSG[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "clusterSG" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Managed by Terraform"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "All"
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "HTTP"
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
        ]
      [32m+[0m[0m name                   = "fiap51-cluster"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # aws_sqs_queue.video_load_queue[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue" "video_load_queue" {
      [32m+[0m[0m arn                               = (known after apply)
      [32m+[0m[0m content_based_deduplication       = false
      [32m+[0m[0m deduplication_scope               = (known after apply)
      [32m+[0m[0m delay_seconds                     = 0
      [32m+[0m[0m fifo_queue                        = true
      [32m+[0m[0m fifo_throughput_limit             = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m kms_data_key_reuse_period_seconds = (known after apply)
      [32m+[0m[0m max_message_size                  = 262144
      [32m+[0m[0m message_retention_seconds         = 345600
      [32m+[0m[0m name                              = "video-carregado-subscriber-queue.fifo"
      [32m+[0m[0m name_prefix                       = (known after apply)
      [32m+[0m[0m policy                            = (known after apply)
      [32m+[0m[0m receive_wait_time_seconds         = 0
      [32m+[0m[0m redrive_allow_policy              = (known after apply)
      [32m+[0m[0m redrive_policy                    = (known after apply)
      [32m+[0m[0m sqs_managed_sse_enabled           = (known after apply)
      [32m+[0m[0m tags_all                          = (known after apply)
      [32m+[0m[0m url                               = (known after apply)
      [32m+[0m[0m visibility_timeout_seconds        = 30
    }

[1m  # aws_sqs_queue.video_status_queue[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue" "video_status_queue" {
      [32m+[0m[0m arn                               = (known after apply)
      [32m+[0m[0m content_based_deduplication       = false
      [32m+[0m[0m deduplication_scope               = (known after apply)
      [32m+[0m[0m delay_seconds                     = 0
      [32m+[0m[0m fifo_queue                        = true
      [32m+[0m[0m fifo_throughput_limit             = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m kms_data_key_reuse_period_seconds = (known after apply)
      [32m+[0m[0m max_message_size                  = 262144
      [32m+[0m[0m message_retention_seconds         = 345600
      [32m+[0m[0m name                              = "video-status-subscriber-queue.fifo"
      [32m+[0m[0m name_prefix                       = (known after apply)
      [32m+[0m[0m policy                            = (known after apply)
      [32m+[0m[0m receive_wait_time_seconds         = 0
      [32m+[0m[0m redrive_allow_policy              = (known after apply)
      [32m+[0m[0m redrive_policy                    = (known after apply)
      [32m+[0m[0m sqs_managed_sse_enabled           = (known after apply)
      [32m+[0m[0m tags_all                          = (known after apply)
      [32m+[0m[0m url                               = (known after apply)
      [32m+[0m[0m visibility_timeout_seconds        = 30
    }

[1m  # aws_sqs_queue_policy.sns_to_sqs_video_load[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue_policy" "sns_to_sqs_video_load" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m policy    = jsonencode(
            {
              [32m+[0m[0m Id        = "__default_policy_ID"
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "arn:aws:iam::090111931170:root"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:187455689029:video-carregado-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "__owner_statement"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:SendMessage"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m ArnLike = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:sns:us-east-1:187455689029:video-carregado-topic.fifo"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "*"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:187455689029:video-carregado-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "topic-subscription-arn:aws:sns:us-east-1:187455689029:video-carregado-topic.fifo"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m queue_url = "https://sqs.us-east-1.amazonaws.com/187455689029/video-carregado-subscriber-queue.fifo"
    }

[1m  # aws_sqs_queue_policy.sns_to_sqs_video_status[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue_policy" "sns_to_sqs_video_status" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m policy    = jsonencode(
            {
              [32m+[0m[0m Id        = "__default_policy_ID"
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "arn:aws:iam::090111931170:root"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:187455689029:video-status-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "__owner_statement"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:SendMessage"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m ArnLike = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:sns:us-east-1:187455689029:video-status-topic.fifo"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "*"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:187455689029:video-status-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "topic-subscription-arn:aws:sns:us-east-1:187455689029:video-status-topic.fifo"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m queue_url = "https://sqs.us-east-1.amazonaws.com/187455689029/video-status-subscriber-queue.fifo"
    }

[1m  # aws_subnet.subnetA[0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnetA" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "public-subnet-eks-a"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "public-subnet-eks-a"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.subnetB[0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnetB" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "public-subnet-eks-b"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "public-subnet-eks-b"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_vpc.frameFlowVpc[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "frameFlowVpc" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "frameFlowVPC"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "frameFlowVPC"
        }
    }

[1m  # module.sns_topic_video_load.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "sns:AddPermission",
              [32m+[0m[0m "sns:DeleteTopic",
              [32m+[0m[0m "sns:GetTopicAttributes",
              [32m+[0m[0m "sns:ListSubscriptionsByTopic",
              [32m+[0m[0m "sns:Publish",
              [32m+[0m[0m "sns:RemovePermission",
              [32m+[0m[0m "sns:SetTopicAttributes",
              [32m+[0m[0m "sns:Subscribe",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
          [32m+[0m[0m sid       = "DefaultStatementID"

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "StringEquals"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "187455689029",
                ]
              [32m+[0m[0m variable = "AWS:SourceAccount"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "SNS:Publish",
            ]
          [32m+[0m[0m resources = (known after apply)
          [32m+[0m[0m sid       = "pub"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::187455689029:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "SNS:Subscribe",
            ]
          [32m+[0m[0m resources = (known after apply)
          [32m+[0m[0m sid       = "sub"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::187455689029:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.sns_topic_video_load.aws_sns_topic.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m beginning_archive_time      = (known after apply)
      [32m+[0m[0m content_based_deduplication = true
      [32m+[0m[0m fifo_topic                  = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "video-carregado-topic.fifo"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m owner                       = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m signature_version           = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "prd"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "prd"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tracing_config              = (known after apply)
    }

[1m  # module.sns_topic_video_load.aws_sns_topic_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_policy" "this" {
      [32m+[0m[0m arn    = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m owner  = (known after apply)
      [32m+[0m[0m policy = (known after apply)
    }

[1m  # module.sns_topic_video_load.aws_sns_topic_subscription.this["sqs"][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "this" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = "arn:aws:sqs:us-east-1:187455689029:video-carregado-subscriber-queue.fifo"
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "sqs"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = (known after apply)
    }

[1m  # module.sns_topic_video_status.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "sns:AddPermission",
              [32m+[0m[0m "sns:DeleteTopic",
              [32m+[0m[0m "sns:GetTopicAttributes",
              [32m+[0m[0m "sns:ListSubscriptionsByTopic",
              [32m+[0m[0m "sns:Publish",
              [32m+[0m[0m "sns:RemovePermission",
              [32m+[0m[0m "sns:SetTopicAttributes",
              [32m+[0m[0m "sns:Subscribe",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
          [32m+[0m[0m sid       = "DefaultStatementID"

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "StringEquals"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "187455689029",
                ]
              [32m+[0m[0m variable = "AWS:SourceAccount"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "SNS:Publish",
            ]
          [32m+[0m[0m resources = (known after apply)
          [32m+[0m[0m sid       = "pub"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::187455689029:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "SNS:Subscribe",
            ]
          [32m+[0m[0m resources = (known after apply)
          [32m+[0m[0m sid       = "sub"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::187455689029:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.sns_topic_video_status.aws_sns_topic.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m beginning_archive_time      = (known after apply)
      [32m+[0m[0m content_based_deduplication = true
      [32m+[0m[0m fifo_topic                  = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "video-status-topic.fifo"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m owner                       = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m signature_version           = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "prd"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "prd"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tracing_config              = (known after apply)
    }

[1m  # module.sns_topic_video_status.aws_sns_topic_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_policy" "this" {
      [32m+[0m[0m arn    = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m owner  = (known after apply)
      [32m+[0m[0m policy = (known after apply)
    }

[1m  # module.sns_topic_video_status.aws_sns_topic_subscription.this["sqs"][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "this" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = "arn:aws:sqs:us-east-1:187455689029:video-status-subscriber-queue.fifo"
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "sqs"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = (known after apply)
    }

[1mPlan:[0m 24 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @RobsonArcoleze, Action: `pull_request`*